tensorXF/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-2.5 0 -3) //0
    (15 0 -3) //1
    (15 5 -3) //2
    (-2.5 5 -3) //3

    (-2.5 0 3) //4
    (15 0 3) //5
    (15 5 3) //6
    (-2.5 5 3) //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (80 20 20) 
    simpleGrading 
    (
      (
        (0.1 0.1 0.5) //(location, num of cells, expansion ratio)
        (0.5 0.6 1)
        (0.4 0.3 2)
      ) //x direction
      (
        (0.3 0.4 1)
        (0.3 0.4 1)
        (0.4 0.2 3)
      ) //y direction
      (
        (0.25 0.15 0.5)
        (0.5 0.7 1)
        (0.25 0.15 2)
      ) //z-direction
    )


);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 2 3)
            (4 5 6 7)
            (0 3 7 4)
            (3 2 6 7)
            (1 2 6 5)
        );
    }
    ground
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
    //symmetry
    //{
        //type symmetry;
        //faces
        //(
            
        //);
    //}
    
);

// ************************************************************************* //
// **************************** tensorXF 2025 ****************************** //
// **************************** pttensor.com ******************************* //